{
	"portfolio_blogs": [
		{
			"id": 3,
			"title": "Eevee Expo Launch and Fleeting Thoughts",
			"date": "10-25-2024",
			"content": "<p>Eevee Expo launched! Remember that? Placeholder text.</p>",
			"blog_status": "null",
			"featured_image_url": "/assets/images/blogs/placeholder.png",
			"column_names_merged_with_images": [
				"id",
				"title",
				"content",
				"blog_status",
				"featured_image"
			]
		},
		{
			"id": 2,
			"title": "Game Jam Conclusion, Crunch, and Winning(?)",
			"date": "10-21-2024",
			"content": "<p><strong>I just finished another Game Jam project!</strong> However, this one was the most challenging and toughest one yet, and required time management more than anything else this time. Let's talk about the wild ride that was the <strong>Eevee Expo Game Jam 2024</strong>!</p>\r\n<p>My usual approach is polish and precision. I personally believe that if I releae anything into the wild, it should devoid of as many immersion-breaking bugs, errors, typos, and the like as possible. Of course, I try my best to apply it to Game Jam projects. After all, who wants to play a good-looking Game Jam game that isn't even playable due to softlocks?</p><p>Around a week left in the jam, the rest of my team got extremely busy with IRL matters. We were about, 60% through the scope I'd planned for the project, but I was <i>very</i> determined to at least end the project with a valid conclusion (I disliked the idea of ending the project on a cliffhanger or abruptly in the middle of an in-game event).</p><p>I would then proceed to perform a 'crunch'. I stayed awake at nights and maximized the amount of time working on the game in order to bring the game into completion, not completely proud of what I was doing, but doing it because of my personal convictions. My team did very much speak out against my decision, but again, I just really disliked the idea of the player leaving the game on an incomplete note. In return, I would take the blame for anything that would happen past the point we were at, I wouldn't dare ask any of them for help for my decision (not that they could).</p> By the time the Jam ended, I had just barely reached the intended ending and submitted the game for judging.",
			"blog_status": "null",
			"featured_image_url": "/assets/images/blogs/placeholder.png",
			"column_names_merged_with_images": [
				"id",
				"title",
				"content",
				"blog_status",
				"featured_image"
			]
		},
		{
			"id": 1,
			"title": "A Work in Progress",
			"date": "9-28-2024",
			"content": "<p><strong>The portfolio is currently a work in progress, I built it from scratch with ReactJS and it wounded me, but I learned a ton. Would it be weird to post my portfolio on my portfolio?</strong></p>\r\n<p>There's a few challenges here and there with submitting things at the moment, specifically the way the Portolio Item descriptions look kind of...overwhelming right now. And the items don't like to update or indent.</p>\r\n<p>At least, I was able to post a bit of a Ghosts of Knowledge post-mortem. I've definitely grown out of it, but being my first completed project, the things I learned working on it were invaluable.&nbsp;</p>\r\n<p>Eventually, I need to update the items to be more of a Gallery than a single thumbnail image, and of course, pretty up the rest of the site. I'll try not to overdo the violet/purple/lavender, but I can't promise anything. I think it's really pretty.</p>\r\n",
			"blog_status": null,
			"featured_image_url": "/assets/images/blogs/blog1Nope.png",
			"column_names_merged_with_images": [
				"id",
				"title",
				"content",
				"blog_status",
				"featured_image"
			]
		},
		{
			"id": 0,
			"title": "We've live! First blog!",
			"date": "9-28-2024",
			"content": "<p><strong>A bit rushed, but we got it done!</strong> This is my slowly, but ever improving portfolio! Currently, as a student, I have simply whatever programming and design things I have completed so far, with only a handful of game projects.</p>\r\n<p><strong>Over time, these will eventually all become just game projects.</strong> I want (and should) post my design documents, my thoughts and ideas on each project, and anything else that feels appropriate for each Portfolio Item.&nbsp;</p>\r\n<p>We've got a long way to go, things are just beginning...!</p>\r\n",
			"blog_status": null,
			"featured_image_url": "/assets/images/blogs/blog1Thumb.png",
			"column_names_merged_with_images": [
				"id",
				"title",
				"content",
				"blog_status",
				"featured_image"
			]
		}
	],
	"meta": {
		"total_pages": 1,
		"total_records": 4
	}
}