{
    "portfolio_items": [
        {
            "id": 3,
            "name": "Eevee Expo",
            "description": "Eevee Expo is an indie games website dedicated to showcasing thousands of indie games, fanworks, and other creative endeavors. \r\n\r\nEevee hosts very regular events for creator engagement, including yearly game jam competitions, news articles for popular and rising projects, and smaller forum incentives for old and new developers alike. \r\n\r\nEevee Expo has a current traffic of 1500 unique visitors per day and has social media plugs at X, BlueSky, and YouTube, run by myself! Check us out in the host link!",
            "information":"My main project that will hopefully always be on-going. As one of the main organizers at Eevee Expo, I regularly curate projects to be showcased in our yearly presentations and on social media to get more eyes on them and to expand many developer's personal playerbases. <br/><br/>I like to sometimes pick up lesser known 'underrated' projects with great potential to showcase in order to prop them up when no one else will. As a main member of the event staff as well, I'm always looking for new ways for people to engage with not just the site, but every developer's passion project.",
            "platform": "N/A",
            "devtime": "On-going!",
            "role": "Project Lead/Social Media",
            "url": "https://eeveeexpo.com/",
            "category": "Other",
            "position": 4,
            "thumb_image_url": "/assets/images/portfolios/expo.png",
            "banner_image_url": [
                "/assets/images/gallery/expo.gif",
                "/assets/images/gallery/expo2.png",
                "/assets/images/gallery/expo3.png"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
                {
            "id": 6,
            "name": "Halff Coffee Hour",
            "description": "A website made for HCI's (Half Community Initiative) Coffee Hour event (Main site is https://halff.com/). A small-scale website where orders are taken by employees, processed through a back-end system for management, and fulfilled by volunteers. Built with React.js. Test it out yourself with username: employee, password: WILACBTIIR",
            "information":"Done for an office initiative to streamline coffee orders for HCI's community day. React.js is used as the framework, employees got through a series of options for their coffee order, limited time slots are available by checking the backend (after 2 people have taken a slot, it's grayed out and can't be chosen), and then orders are sent to a Google form for the manager to view the orders.<br/><br/>Some fun additions to the site include completely custom made coffee images for each of the order buttons.",
            "platform": "N/A",
            "devtime": "On-going!",
            "role": "Sole Developer",
            "url": "https://weimprovelivesandcommunitiesbyturningideasintoreality.com/",
            "category": "Other",
            "position": 4,
            "thumb_image_url": "/assets/images/portfolios/coffees.png",
            "banner_image_url": [
                "/assets/images/gallery/coffees1.png",
                "/assets/images/gallery/coffees2.png",
                "/assets/images/gallery/coffees3.png",
                "/assets/images/gallery/coffees4.png"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 5,
            "name": "Maplemon",
            "description": "Maplemon is a monster-catching/platformer hybrid RPG created for MapleJam 2024 ($10,000 prize pool). The Hackathon required the use of the Maplestory Worlds platform, and Maplestory assets were provided. This game project features prominently the ability to catch, battle, and explore with iconic monsters from Maplestory. \r\n\r\nYou play as a Maplestory player that has fallen from the surface world, and are told that the monsters in this New World cannot be harmed with your traditional weapons. You must ally yourselves with the monsters in order to survive. <br/><br/><strong>Winner for MapleJam 2024!</strong><br/><br/><span style=\"font-size: 16px;\"><strong>Responsibilities:</strong></span><br/><br/><ul style=\"margin-top: 0;\"><li>Lead UI/UX Designer</li><li>Framing and building Game Design Documentat and UI Design Page</li><li>Designing core gameplay loop and systems, including flowcharts</li><li>Spritework, tileset organization, art direction, and asset creation/crediting</li><li>Recruitment and task management</li><li>Managing scope, engine limitations, possibilities, and deadlines</li></ul>",
            "information":"This hackathon was the first game jam project that I've actually won a cash prize for, and we had tough competition. As the lead developer, I was not only in charge of recruiting for the team and getting the right talent for the project, but I was also the lead UI designer, the lead game designer, and putting on different hats to help with every other facet of the project that I was not personally in charge of.<br/><br/> We used Jira to keep track our work schedule and I used personally used Figma to draw out the way the Battle Scene would work along with the battle interface, which was arguably the most complicated part of the game jam. Releasing this project itself was a monumental achievement, but winning the competition was even more so!",
            "platform": "PC+Mobile",
            "devtime": "1 month -> On-going!",
            "role": "Project Lead/UI Designer/Game Designer",
            "url": "https://maplestoryworlds.nexon.com/play/1ba292fc16a14cf78dfc288d36546f6f",
            "category": "Game Projects",
            "position": 1,
            "thumb_image_url": "/assets/images/portfolios/maples.png",
            "banner_image_url": [
                "/assets/images/gallery/maples2.gif",
                "/assets/images/gallery/maples1.gif",
                "/assets/images/gallery/maples3.gif",
                "/assets/images/gallery/maples4.gif",
                "/assets/images/gallery/maples5.png",
                "/assets/images/gallery/maples6.png"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 0,
            "name": "Ghosts of Knowledge",          
            
                "description": "An RPG developed for a 1-month Game Jam competition inspired by the Metroidvania genre and Pokémon. You play as Dust, an explorer who stumbles upon an underwater cave and the remains of a world hidden beneath the surface. Unlock paths, solve puzzles, battle, and snag some relics wherever you see them!<br/><br/><strong>Winner for the 6th Relic Castle Game Jam!</strong><br/><br/><span style=\"font-size: 16px;\"><strong>Responsibilities:</strong></span><br/><br/><ul style=\"margin-top: 0;\"><li>Documenting basic gameplay loop ideas and map design to keep the team organized</li><li>Collaborated with team members for puzzle design (a prominent recurring mechanic), testing and iterating on puzzles for the best possible player experience</li><li>Spritework, tileset organization, art direction, and asset creation/crediting</li><li>Sculpting the vision of the final project, and splitting/assigning needed tasks to team members</li><li>Checking minimum viable product values, assessing the game's pacing, and implementing/discarding features as time permits</li><li>Wrestling with the engine limits, possibilities, and identifying the less polished areas, as we were using a relatively new engine</li></ul>"
              ,
            "information": "This was developed within a French Monster Collecting engine known as PSDK, which utilized Ruby, a little bit of C++, and a graphic engine they developed themselves called LiteRGSS.\r\n\r\n <br/><br/>The competition this project was developed for always has a theme and contestants were asked to develop a Pokémon RPG with whatever engine of choice. I decided I'd go for something that would be easier to split in a few weeks, rather than a dedicated gym challenge seen in regular Pokémon games, so this has a fully original story. My focus for the game desihn was the make the gameplay loop fit the shortened development schedule while still maintaing the rules of traditional Pokémon gameplay.",
            "platform": "PC",
            "devtime": "1 month (Game Jam)",
            "role": "Project Lead/UI Designer/Game Designer",
            "url": "https://eeveeexpo.com/ghosts-of-knowledge/",
            "category": "Game Projects",
            "position": 2,
            "thumb_image_url": "/assets/images/portfolios/ghosts.png",
            "banner_image_url": [
                "/assets/images/gallery/ghosts1.gif",
                "/assets/images/gallery/ghosts4.gif",
                "/assets/images/gallery/ghosts3.gif",
                "/assets/images/gallery/ghosts2.gif",
                "/assets/images/gallery/ghosts5.png"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 1,
            "name": "Bloodlines",
            "description": "A top-down exploration game primarily created for a 3-week Game Jam. In a snow-filled province of the Ede region, a fateful letter and a twist of fate sends off a young lady and a wrathful creature on a cold journey.\r\n\r\nIn the Ede Region, the world is in a constant state of snowfall and controlled by the massive businesss conglomerate the Gully Consortium. Journey through the region and experience how these two elements influence the people who try to live normal lives, and see what can change and what truly can't.",
            "information":"This project was my project immediately after the 'Ghosts of Knowledge' project, so everything I learned from that Game Jam project funnelled itself to its fullest potential in this one. This included learning to draw and organize my own UI, being much more meticulous with presentation (something I always believe can be more and more improved), and tightening the game design. <br/><br/>I also learned to use supplementary tools during the development of this project, including Figma, which I now use daily in other game design projects I still work on this game to this day, and it's my personal favorite project to work on.",
            "platform": "PC",
            "devtime": "On-going!",
            "role": "Project Lead/UI Designer/Game Designer",
            "url": "https://eeveeexpo.com/threads/8168",
            "category": "Game Projects",
            "position": 3,
            "thumb_image_url": "/assets/images/portfolios/bloodlines.png",
            "banner_image_url": [
                "/assets/images/gallery/bloodlines1.gif",
                "/assets/images/gallery/bloodlines2.gif",
                "/assets/images/gallery/bloodlines3.gif",
                "/assets/images/gallery/bloodlines4.png"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 2,
            "name": "A Star in the Desert",
            "description": "A top-down exploration game primarily created for a 3-week Game Jam. This game is a tribute to the Pokémon Mystery Dungeon series.<br/><br/>Waking up dragged along in the desert with no memories as to how you got here, you soon find yourself tagging along with a timid, but well meaning, Sobble to take down various outlaws that this rough region has to offer. Perhaps you'll be able to find the answer as to why you've become a Pokémon, but more important problems exist...<br/><br/><strong>Winner for the Eevee Expo Game Jam 2024!</strong><br/><br/>",
            "information": "This project is a love-letter to the Mystery Dungeon series, one of my personal favorite game series to exist. The storytelling, tone, writing, and general direction is heavily influenced by the motifs and story beats of Mystery Dungeon, but with an added twist of the 'man vs nature' element. <br/><br/>The UI/UX, game design, and general story beats were done by me, and the main art direction and assets, dialogue, and level design was done by my team in a much greater split. This project also won the Game Jam it was a part of!",
            "platform": "PC",
            "devtime": "On-going!",
            "role": "Project Lead/UI Designer/Game Designer",
            "url": "https://imruru.itch.io/a-star-in-the-desert",
            "category": "Game Projects",
            "position": 1,
            "thumb_image_url": "/assets/images/portfolios/stars.png",
            "banner_image_url": [
                "/assets/images/gallery/star1.gif",
                "/assets/images/gallery/star2.gif",
                "/assets/images/gallery/star3.gif",
                "/assets/images/gallery/star4.gif",
                "/assets/images/gallery/star5.gif",
                "/assets/images/gallery/star6.gif"
            ],
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "information",
                "platform",
                "devtime",
                "role",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        }
    ]
}