{
    "portfolio_items": [
        {
            "id": 0,
            "name": "Ghosts of Knowledge",
            "description": "A top-down exploration RPG developed for a 3 week Game Jam competition. This was developed within a French Monster Collecting engine known as PSDK, which utilized Ruby, a little bit of C++, and a graphic engine they developed themselves called LiteRGSS.          \r\n                                                                                                                     \r\nThe competition this project was developed for always has a theme and contestants were asked to develop a Pokémon RPG with whatever engine of choice. I decided I'd go for something that would be easier to split in a few weeks, rather than a dedicated gym challenge seen in regular Pokémon games, so this has a fully original story. \r\n\r\nYou play as Dust, an explorer who stumbles upon an underwater cave and the world hidden beneath the surface. Unlock paths, gather history, and snag some treasure whenever you can find it!\r\n\r\nWorking in a team as 4 as the lead developer, I was responsible for:\r\n\r\n- Coming up with the story/gameplay loop. This includes writing all of the dialogue. I split the game into three areas, with 5 hidden \"treasures\" within each. You found these just walking around and exploring the overworld. Collecting them at intervals gave the players various rewards that would help them in battle. They also publicly display at the player's base with fun flavor text. There are also a lot of optional treasures that can still be traded in, but would give a strong random award. Wild Pokémon drop these at a small chance (10%).\r\n\r\n- Figuring out how many mechanics we could feasibly import into this game. Turns out, Pokémon has a lot of mechanics, and a lot of conditional ones too. The first thing I did was add just a few moves, and curate fights to make sure the moves that did exist flowed into the gameplay well. Lots of playtesting was in order to check the overall game balance, prioritizing fast fights with very few gauntlets in order to get the player back to the overworld as much as possible, since the focus is on exploring.\r\n\r\n- The general game setting and art direction. A ton of the art in this project was either edited and credited public resources or completely sprited from scratch. The biggest outlier was the Pokémon sprites themselves.\r\n\r\n- Bringing everyone's contributions together and having the game in a playable and releasable state. The puzzles, map design, and art I had assistance in, but it was on me to make sure that they all make it in the game and works well. \r\n\r\nThis marks my first planned game project that was actually able to make the finish line.",
            "url": "https://imruru.itch.io/ghosts-of-knowledge",
            "category": "Game Projects",
            "position": -1,
            "thumb_image_url": "/assets/images/portfolios/ghosts.png",
            "banner_image_url": "/assets/images/portfolios/ghosts.png",
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 1,
            "name": "Angular World Map",
            "description": "Testing An interactive world map built with AngularJS. It pulls in data from an API to get statistics about countries around the world. A small project built to test my knowledge utilizing APIs for my Software Engineering degree.",
            "url": "https://dl-world-map-9f54f581e736.herokuapp.com/",
            "category": "Activities",
            "position": 3,
            "thumb_image_url": "/assets/images/portfolios/map.png",
            "banner_image_url": "https://devcamp-space.s3.amazonaws.com/S7kDXjHYSvwPBimE78imDpN5?response-content-disposition=inline%3B%20filename%3D%22firefox_8tbiK7Vz9B.png%22%3B%20filename%2A%3DUTF-8%27%27firefox_8tbiK7Vz9B.png\u0026response-content-type=image%2Fpng\u0026X-Amz-Algorithm=AWS4-HMAC-SHA256\u0026X-Amz-Credential=AKIAJEHZJNHM5JFESRRQ%2F20240110%2Fus-east-1%2Fs3%2Faws4_request\u0026X-Amz-Date=20240110T173529Z\u0026X-Amz-Expires=300\u0026X-Amz-SignedHeaders=host\u0026X-Amz-Signature=1e438ec69b7136cd2bb7f5020cabc2c2b3650cb5e3c6045afaa4be55730220bc",
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 2,
            "name": "Bloodlines",
            "description": "A top-down exploration game primarily created for a 3-week Game Jam. In a snow-filled province of the Ede region, a fateful letter and a twist of fate sends off a young lady and a wrathful creature on a cold journey.\r\n\r\nUI/UX Figma: https://www.figma.com/file/Q10iUfnJiEsdVBtEa6Gp9e/Bloodlines-UI?type=design\u0026node-id=0%3A1\u0026mode=design\u0026t=cHtIAgi1kqyx2pcx-1\r\n\r\nHost Link has more details (sorry still working on the site to go in-depth development wise...)",
            "url": "https://eeveeexpo.com/threads/8168",
            "category": "Game Projects",
            "position": 2,
            "thumb_image_url": "/assets/images/portfolios/bloodlines.png",
            "banner_image_url": "/assets/images/portfolios/bloodlines.png",
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 3,
            "name": "A Star in the Desert",
            "description": "A top-down exploration game primarily created for a 3-week Game Jam. This game is a tribute to the Pokémon Mystery Dungeon series.",
            "url": "https://imruru.itch.io/a-star-in-the-desert",
            "category": "Game Projects",
            "position": 3,
            "thumb_image_url": "/assets/images/portfolios/stars.png",
            "banner_image_url": "/assets/images/portfolios/stars.png",
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        },
        {
            "id": 4,
            "name": "Eevee Expo",
            "description": "Eevee Expo is an indie games website dedicated to showcasing thousands of indie games, fanworks, and other creative endeavors.",
            "url": "https://eeveeexpo.com/",
            "category": "Other",
            "position": 3,
            "thumb_image_url": "/assets/images/portfolios/expo.png",
            "banner_image_url": "/assets/images/portfolios/expo.png",
            "logo_url": null,
            "column_names_merged_with_images": [
                "id",
                "name",
                "description",
                "url",
                "category",
                "position",
                "thumb_image",
                "banner_image",
                "logo"
            ]
        }
    ]
}